tutorials/conjugateHeatTransfer/flowOverHeatedPlate_testSuite/baseCase/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            wall;
        nFaces          41;
        startFace       16159;
    }
    right
    {
        type            wall;
        nFaces          41;
        startFace       16200;
    }
    top
    {
        type            wall;
        nFaces          200;
        startFace       16241;
    }
    bottom
    {
        type            wall;
        nFaces          200;
        startFace       16441;
    }
    defaultFaces
    {
        type            empty;
        nFaces          16400;
        startFace       16641;
    }
)


// ************************************************************************* //
